* name 
* gender
* race 
* age 
* phone number 
* dob 
* aadhar 
* email 
* address 
* Fingerprints

In [1]:
import pandas as pd
import random_address
import numpy as np

In [2]:
name_male = pd.read_csv("D:\VIIT\ML\SIH data\SIH_Pyxis\sai\Indian-Male-Names.csv")

In [3]:
name_male.head()

              name gender    race
0          barjraj      m  indian
1     ramdin verma      m  indian
2  sharat chandran      m  indian
3  birender mandal      m  indian
4             amit      m  indian

In [4]:
name_female =  pd.read_csv("D:\VIIT\ML\SIH data\SIH_Pyxis\sai\Indian-Female-Names.csv")

In [5]:
name_female

                            name gender    race
0                        shivani      f  indian
1                           isha      f  indian
2                smt shyani devi      f  indian
3                          divya      f  indian
4                          mansi      f  indian
...                          ...    ...     ...
15377                 saroj devi      f  indian
15378              naina @ geeta      f  indian
15379  manju d/0 baboo lal jatav      f  indian
15380                    shivani      f  indian
15381                      nayna      f  indian

[15382 rows x 3 columns]

In [6]:
nm = name_male[:300]

In [7]:
nf = name_female[:300]

In [8]:
name = pd.concat([nm,nf])

In [9]:
type(name)

pandas.core.frame.DataFrame

In [10]:
name = np.array(name)

In [11]:
name = pd.DataFrame(name,columns=["name","gender","race"])

In [12]:
type(name)

pandas.core.frame.DataFrame

In [13]:
name = name.sample(frac = 1)

In [14]:
name.head()

              name gender    race
462         anjali      f  indian
115  pulkit sharma      m  indian
421     laxmi devi      f  indian
418           doly      f  indian
498          kajal      f  indian

In [15]:
add = random_address.real_random_address_by_state("CA")

In [16]:
add

{'address1': '2035 Ninth Street',
 'address2': 'R A',
 'city': 'Berkeley',
 'state': 'CA',
 'postalCode': '94710',
 'coordinates': {'lat': 37.8676351, 'lng': -122.2938418}}

In [17]:
import random

In [18]:
phno = []

In [19]:
for i in range(600):
    phno.append(random.randint(1000000000,9999999999))

In [20]:
phone_no = np.array(phno)

In [21]:
phone_no = pd.DataFrame(phone_no,columns=["phone_name"])

In [22]:
dob = []

In [23]:
import pandas as pd
import numpy as np
from datetime import date, timedelta
from random import choices
test_date1, test_date2 = date(1922, 1,1 ), date(2022, 1, 1)
K = 600
res_dates = [test_date1]
while test_date1 != test_date2:
    test_date1 += timedelta(days=1)
    res_dates.append(test_date1)
res = choices(res_dates, k=K)
dob.append(res)

In [24]:
phone_no.head()

   phone_name
0  6513761569
1  1104101424
2  6132973339
3  6952348538
4  2298045003

In [25]:
from datetime import datetime

In [26]:
dob_year = []
dob_month = []
dob_day = []
dob_yr = []

In [27]:
for i in range(600):

    year = dob[0][i].strftime("%Y")
    month = dob[0][i].strftime("%m")
    day = dob[0][i].strftime("%d")
    dob_yr.append(year)
    dob_month.append(month)
    dob_day.append(day)

In [28]:
dob_year = np.array(dob_yr)
dob_month = np.array(dob_month)
dob_day = np.array(dob_day)

In [29]:
dob_year = pd.DataFrame(dob_year,columns=["dob_year"])
dob_month = pd.DataFrame(dob_month,columns=["dob_year"])
dob_day = pd.DataFrame(dob_day,columns=["dob_year"])

In [30]:
dob_year.head()

  dob_year
0     1937
1     1933
2     1939
3     1978
4     2011

In [31]:
age =[]
for i in dob_yr:
    age.append(int((date.today().year-int(i))))

In [32]:
type(age[10])

int

In [33]:
age = np.array(age)
age = pd.DataFrame(age,columns=["age"])

In [34]:
age.head()

   age
0   85
1   89
2   83
3   44
4   11

In [35]:
addhar_no = []
for i in range(600):
    addhar_no.append(random.randint(100000000000,999999999999))
addhar_no = np.array(addhar_no)
addhar_no = pd.DataFrame(addhar_no,columns=["addhar_no"])

In [36]:
addhar_no.head()

      addhar_no
0  115956685386
1  689873677613
2  676532421337
3  574942130484
4  868456471405

In [37]:
n = np.array(name["name"])

In [38]:
type(n[1])

str

In [39]:
name["name"][3]

'birender mandal'

In [40]:
k = name["name"][3]
counter = 0

for j in n:
        for i in j:
            print(i)
        counter += 1

a
n
j
a
l
i
p
u
l
k
i
t

s
h
a
r
m
a
l
a
x
m
i

d
e
v
i
d
o
l
y
k
a
j
a
l
s
h
e
e
t
a
l
g
u
d
d
u
m
i
n
a
k
c
h
i
k
h
u
s
h
b
u
m
o
h
d

s
h
a
k
i
b
r
o
h
i
t
g
o
p
a
l

s
h
a
r
m
a
d
u
r
g
a
r
a
s
h
i
d
d
h
a
r
m
b
i
r
a
m
a
n
s
h
i
v

k
u
m
a
r
k
a
r
i
n
a

@

k
a
v
i
t
a
r
a
j
u

@

c
h
h
o
t
u
m
a
h
a
b
i
r

p
r
a
s
a
d
a
r
j
u
n
k
o
m
a
l
s
a
g
a
r
r
a
j
e
n
d
e
r
r
a
k
h
i
a
n
u
b
h
a
v

s
h
r
i
v
a
s
t
a
b
m
a
d
a
n
r
a
m
v
a
t
i
p
o
o
n
a
m
h
u
m
a

k
h
a
n
s
h
e
e
t
a
l

TypeError: 'float' object is not iterable

In [41]:
name_new = pd.read_csv("name_600.csv")

In [42]:
name_new.head()

              name gender    race
0      asha kumari      f  indian
1            nitin      m  indian
2           tripti      f  indian
3         som dutt      m  indian
4  bhagwati prasad      m  indian

In [43]:
email = pd.read_csv("email.csv")

In [44]:
email.head()

       ashakumari@gmail.com
0           nitin@gmail.com
1          tripti@gmail.com
2         somdutt@gmail.com
3  bhagwatiprasad@gmail.com
4         yognder@gmail.com

In [45]:
address = []

In [46]:

for i in range(600):
    from faker import Faker
    fake = Faker(["en_IN"])
    temp1 =[fake.address(),fake.state()]
    address.append(temp1)

In [47]:
address = np.array(address)

In [48]:
address = pd.DataFrame(address,columns=["address","state"])

In [49]:
address.head()

                                  address              state
0         517, Shankar Zila, Surat-656571            Tripura
1  52\nBahri Ganj, Tiruchirappalli-922389          Karnataka
2     18/446, Char Ganj, Allahabad-397982        West Bengal
3  H.No. 63\nMaster Road\nPanihati-911572          Rajasthan
4      H.No. 28, Gade Marg, Nashik-463694  Arunachal Pradesh

In [50]:
temp = name_new["name"]
data = pd.DataFrame(temp,columns=["name"])

In [51]:
data["gender"] = name_new["gender"]

In [52]:
data["race"] = name_new["race"]

In [53]:
data["age"] = age

In [54]:
data["phone_no"] = phone_no

In [55]:
data["dob_year"] = dob_year

In [56]:
data["dob_month"] = dob_month

In [57]:
data["dob_day"] = dob_day

In [58]:
data["addhar_no"] = addhar_no

In [59]:
data["email"] = email

In [60]:
data["address"] = address["address"]

In [61]:
data["state"] = address["state"]

In [62]:
data.head()

,name,gender,race,age,phone_no,dob_year,dob_month,dob_day,addhar_no,email,address,state
0,asha kumari,f,indian,85,6513761569,1937,07,13,115956685386,nitin@gmail.com,"517, Shankar Zila, Surat-656571",Tripura
1,nitin,m,indian,89,1104101424,1933,10,19,689873677613,tripti@gmail.com,"52\nBahri Ganj, Tiruchirappalli-922389",Karnataka
2,tripti,f,indian,83,6132973339,1939,04,24,676532421337,somdutt@gmail.com,"18/446, Char Ganj, Allahabad-397982",West Bengal
3,som dutt,m,indian,44,6952348538,1978,10,19,574942130484,bhagwatiprasad@gmail.com,H.No. 63\nMaster Road\nPanihati-911572,Rajasthan
4,bhagwati prasad,m,indian,11,2298045003,2011,08,10,868456471405,yognder@gmail.com,"H.No. 28, Gade Marg, Nashik-463694",Arunachal Pradesh

In [63]:
name_new.to_csv("name_new.csv",index= False)

In [ ]:
img_rgt_thumb = []
img_rgt_index = []
img_rgt_middle = []
img_rgt_ring = []
img_rgt_little = []

img_left_thumb = []
img_left_index = []
img_left_middle = []
img_left_ring = []
img_left_little = []
for i in range(300):
    img_rgt_thumb.append(str(i)+"__M_Right_thumb_finger") 
    img_rgt_index.append(str(i)+"__M_Right_index_finger") 
    img_rgt_middle.append(str(i)+"__M_Right_middle_finger")  
    img_rgt_ring.append(str(i)+"__M_Right_ring_finger")  
    img_rgt_little.append(str(i)+"__M_Right_little_finger") 
    
    img_left_thumb.append(str(i)+"__M_Left_thumb_finger") 
    img_left_index.append(str(i)+"__M_Left_index_finger") 
    img_left_middle.append(str(i)+"__M_Left_middle_finger")  
    img_left_ring.append(str(i)+"__M_Left_ring_finger")  
    img_left_little.append(str(i)+"__M_Left_little_finger")

In [ ]:
for i in range(300,600):
    img_rgt_thumb.append(str(i)+"__F_Right_thumb_finger") 
    img_rgt_index.append(str(i)+"__F_Right_index_finger") 
    img_rgt_middle.append(str(i)+"__F_Right_middle_finger")  
    img_rgt_ring.append(str(i)+"__F_Right_ring_finger")  
    img_rgt_little.append(str(i)+"__F_Right_little_finger") 
    
    img_left_thumb.append(str(i)+"__F_Left_thumb_finger") 
    img_left_index.append(str(i)+"__F_Left_index_finger") 
    img_left_middle.append(str(i)+"__F_Left_middle_finger")  
    img_left_ring.append(str(i)+"__F_Left_ring_finger")  
    img_left_little.append(str(i)+"__F_Left_little_finger")

In [ ]:
data["img_rgt_thumb"] = img_rgt_thumb
data["img_rgt_index"] = img_rgt_index
data["img_rgt_middle"] = img_rgt_middle
data["img_rgt_ring"] = img_rgt_ring
data["img_rgt_little"] = img_rgt_little
data["img_left_thumb"] = img_left_thumb
data["img_left_index"] = img_left_index
data["img_left_middle"] = img_left_middle
data["img_left_ring"] = img_left_ring
data["img_left_little"] = img_left_little

In [ ]:
data.head()

In [ ]:
name_updated = pd.read_csv("email_copy.csv")

In [ ]:
name_updated1 = pd.DataFrame(name_updated,columns=["name_updated"])

In [ ]:
name_updated.head()

In [ ]:
data["name"] = name_updated

In [ ]:
data.head()

In [ ]:
import os

In [ ]:
img = os. listdir("Real")

In [ ]:
img

In [ ]:
img_rgt_thumb = []
img_rgt_index = []
img_rgt_middle = []
img_rgt_ring = []
img_rgt_little = []

img_left_thumb = []
img_left_index = []
img_left_middle = []
img_left_ring = []
img_left_little = []

for i in range(6000):
    if "Left_index" in img[i]:
        img_left_index.append(img[i])
    elif "Left_little" in img[i]:
        img_left_little.append(img[i])
    elif "Left_middle" in img[i]:
        img_left_middle.append(img[i])    
    elif "Left_ring" in img[i]:
        img_left_ring.append(img[i])
    elif "Left_thumb" in img[i]:
        img_left_thumb.append(img[i])
    elif "Right_index" in img[i]:
        img_rgt_index.append(img[i])
    elif "Right_little" in img[i]:
        img_rgt_little.append(img[i])
    elif "Right_middle" in img[i]:
        img_rgt_middle.append(img[i])
    elif "Right_ring" in img[i]:
        img_rgt_ring.append(img[i])
    elif "Right_thumb" in img[i]:
        img_rgt_thumb.append(img[i])

In [ ]:
if "Left" in img[0]:
    print("yes")

In [ ]:
data["img_rgt_thumb"] = img_rgt_thumb
data["img_rgt_index"] = img_rgt_index
data["img_rgt_middle"] = img_rgt_middle
data["img_rgt_ring"] = img_rgt_ring
data["img_rgt_little"] = img_rgt_little
data["img_left_thumb"] = img_left_thumb
data["img_left_index"] = img_left_index
data["img_left_middle"] = img_left_middle
data["img_left_ring"] = img_left_ring
data["img_left_little"] = img_left_little

In [ ]:
len(img_rgt_thumb)

In [ ]:
len(img_left_index)

In [ ]:
data.head()

In [ ]:
data.to_csv("data.csv",index=False)

In [ ]:
data = pd.read_csv("data.csv")

In [ ]:
data.head()